In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['raksha','chauhan','sneha','ragini'],
    "marks":[12,34,24,17],
    "city":['rajasthan','surat','rampur','kolkata']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

      name  marks       city
0   raksha     12  rajasthan
1  chauhan     34      surat
2    sneha     24     rampur
3   ragini     17    kolkata

In [7]:
dff = df.to_csv('friends.csv')

In [9]:
dff